УТ_для_edt/src/Documents/смартФинансовыеПотоки/смартФинансовыеПотоки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартФинансовыеПотоки</name>
  <comment>//++ #Б-3852 смарт: Фролов 17.07.2025 //Разработка механизма, позволяющего перенести работу из EXCELL в 1С - Первый этап, проектирование.</comment>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.смартФинансовыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеИзменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартВидыРасчетовФинансовыхПоказателей/смартВидыРасчетовФинансовыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыРасчетовФинансовыхПоказателей</name>
  <comment>//++ #Б-3852 смарт: Фролов 18.07.2025 //Разработка механизма, позволяющего перенести работу из EXCELL в 1С - Первый этап, проектирование.</comment>
  <enumValues>
    <name>РучнойВПлюс</name>
  </enumValues>
  <enumValues>
    <name>РучнойВМинус</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическийВПлюс</name>
  </enumValues>
  <enumValues>
    <name>АвтоматическийВМинус</name>
  </enumValues>
  <enumValues>
    <name>Подитог</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств/СтатусыЗаявокНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаРасходованиеДенежныхСредств</name>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартНастройкиФинансовыхПотоков/смартНастройкиФинансовыхПотоков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартНастройкиФинансовыхПотоков</name>
  <comment>//++ #Б-3852 смарт: Фролов 18.07.2025 //Разработка механизма, позволяющего перенести работу из EXCELL в 1С - Первый этап, проектирование.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ОрганизацияИлиБанк</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транзитный</name>
    <comment>//++ #Б-4676 смарт: Фролов 10.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Овернайт</name>
    <comment>//++ #Б-4750 смарт: Фролов 17.10.2025 //Доработки обработки Финансовые потоки.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаВТаблице</name>
    <comment>//++ #Б-4774 смарт: Фролов 23.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаВТаблице</name>
    <comment>//++ #Б-4774 смарт: Фролов 23.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСчета</name>
    <comment>//++ #Б-4774 смарт: Фролов 23.10.2025 //Доработка обработки &quot;Управление финансовыми потоками&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/БанковскиеСчетаОрганизаций/БанковскиеСчетаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчетаОрганизаций</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыБанковскихСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкДляРасчетов</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКорреспондента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыводаМесяца</name>
    <type>
      <types>EnumRef.ВариантыВыводаМесяцаВДатеДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСуммуБезКопеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбменСБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Программа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПлатежиБезУказанияЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>БИКБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеИзменениеРеквизитовБанка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанкаМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресБанка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныБанка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БИКБанкаДляРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеИзменениеРеквизитовБанкаДляРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанкаДляРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБанкаДляРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородБанкаДляРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресБанкаДляРасчетов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныБанкаДляРасчетов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямойОбменСБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменСБанкомВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СВИФТБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СВИФТБанкаДляРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностранныйБанк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВБанкеДляРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйСчетГОЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородБанкаМеждународный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресБанкаМеждународный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанкаДляРасчетовМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородБанкаДляРасчетовМеждународный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресБанкаДляРасчетовМеждународный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаБанка</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаБанкаДляРасчетов</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>смартИспользоватьПоУмолчаниюДляВалюты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартФинансовыеПоказатели/смартФинансовыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартФинансовыеПоказатели</name>
  <comment>//++ #Б-3852 смарт: Фролов 17.07.2025 //Разработка механизма, позволяющего перенести работу из EXCELL в 1С - Первый этап, проектирование.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.смартВидыРасчетовФинансовыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Documents/смартФинансовыеПотоки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;	
	
	ЗаполнитьТаблицуФинансовыхПотоков();
	
	ЗаполнитьФинансовыеПоказатели();
	
	ЗаполнитьФинансовыеПоказателиАвтоматические(); 
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьДаннымиТабличнойЧасти();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Платежи.Очистить();
	
	Для Каждого СтрТабФинансовыхПотоков Из ТабФинансовыхПотоков Цикл
		
		Если СтрТабФинансовыхПотоков.ВидПоказателя = ПредопределенноеЗначение("Перечисление.смартВидыРасчетовФинансовыхПоказателей.Подитог") Тогда
			Продолжить;
		КонецЕсли;	
			
		Для Каждого СтрТабБанковскиеСчета Из ТабБанковскиеСчета Цикл
			
			Если НЕ СтрТабФинансовыхПотоков["КолонкаБанк_" + СтрТабБанковскиеСчета.ИмяКолонки] = 0 Тогда
				
				СтрПлатежи = Объект.Платежи.Добавить();
				СтрПлатежи.Показатель = СтрТабФинансовыхПотоков.Показатель;
				СтрПлатежи.БанковскийСчет = СтрТабБанковскиеСчета.БанковскийСчет;
				СтрПлатежи.Сумма = СтрТабФинансовыхПотоков["КолонкаБанк_" + СтрТабБанковскиеСчета.ИмяКолонки];
				
				СтрокиТаблицаРучныхИзменений = ТаблицаРучныхИзменений.НайтиСтроки(Новый Структура("Показатель, БанковскийСчет", 
					СтрТабФинансовыхПотоков.Показатель, СтрТабБанковскиеСчета.БанковскийСчет));
					
				Если СтрокиТаблицаРучныхИзменений.Количество() > 0 Тогда
					СтрПлатежи.РучноеИзменение = Истина;			
				КонецЕсли;		
		
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи); 
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

#КонецОбласти 


&НаСервере
Процедура ЗаполнитьТаблицуФинансовыхПотоков()
	
	ЗаполнитьТаблицуБанковскиеСчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуБанковскиеСчета()
	
	ТабБанковскиеСчета.Очистить();
	ТабОрганизации.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартНастройкиФинансовыхПотоков.ОрганизацияИлиБанк КАК БанковскийСчет,
	|	смартНастройкиФинансовыхПотоков.ОрганизацияИлиБанк.Владелец КАК Организация,
	|	смартНастройкиФинансовыхПотоков.Наименование КАК Наименование,
	|	смартНастройкиФинансовыхПотоков.Ссылка КАК Настройка
	|ИЗ
	|	Справочник.смартНастройкиФинансовыхПотоков КАК смартНастройкиФинансовыхПотоков
	|ГДЕ
	|	смартНастройкиФинансовыхПотоков.ОрганизацияИлиБанк ССЫЛКА Справочник.БанковскиеСчетаОрганизаций
	|	И НЕ смартНастройкиФинансовыхПотоков.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартНастройкиФинансовыхПотоков.Сортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартНастройкиФинансовыхПотоков.ОрганизацияИлиБанк КАК Организация,
	|	смартНастройкиФинансовыхПотоков.Наименование КАК Наименование,
	|	смартНастройкиФинансовыхПотоков.Ссылка КАК Настройка
	|ИЗ
	|	Справочник.смартНастройкиФинансовыхПотоков КАК смартНастройкиФинансовыхПотоков
	|ГДЕ
	|	смартНастройкиФинансовыхПотоков.ОрганизацияИлиБанк ССЫЛКА Справочник.Организации
	|	И НЕ смартНастройкиФинансовыхПотоков.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартНастройкиФинансовыхПотоков.Сортировка");
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Результат = МассивРезультатов[0].Выгрузить();
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		СтрТабБанковскиеСчета = ТабБанковскиеСчета.Добавить();
		СтрТабБанковскиеСчета.Организация = СтрРезультат.Организация;
		СтрТабБанковскиеСчета.БанковскийСчет = СтрРезультат.БанковскийСчет;
		СтрТабБанковскиеСчета.Заголовок = СтрРезультат.Наименование;
		СтрТабБанковскиеСчета.Настройка = СтрРезультат.Настройка;
		СтрТабБанковскиеСчета.ИмяКолонки = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");	
		
	КонецЦикла;
	
	Результат = МассивРезультатов[1].Выгрузить();
	
	Для Каждого СтрРезультат Из Результат Цикл
		
		СтрТабОрганизации = ТабОрганизации.Добавить();
		СтрТабОрганизации.Организация = СтрРезультат.Организация;
		СтрТабОрганизации.Заголовок = СтрРезультат.Наименование;
		СтрТабОрганизации.Настройка = СтрРезультат.Настройка;	
		
	КонецЦикла;	
	
	УбратьДобавитьКолонкиВТабБанковскиеСчета();
	
КонецПроцедуры

&НаСервере
Процедура УбратьДобавитьКолонкиВТабБанковскиеСчета()
	
	КолонкиДобавляемые = Новый Массив;
	КолонкиУдаляемые = Новый Массив;
	
	Для Каждого Стр Из ЭтаФорма.ТабБанковскиеСчета Цикл 
		
		Если Стр.Замещен Тогда
			
			КолонкиУдаляемые.Добавить("ТабФинансовыхПотоков." + "КолонкаБанк_" + Стр.ИмяКолонки);
			
		Иначе	
			
			Если ЭтаФорма.Элементы.Найти("КолонкаБанк_" + Стр.ИмяКолонки) = Неопределено ТОгда
				
				КолонкиДобавляемые.Добавить(Новый РеквизитФормы("КолонкаБанк_" + Стр.ИмяКолонки,
					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)), "ТабФинансовыхПотоков", Стр.Заголовок));

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	ИзменитьРеквизиты(КолонкиДобавляемые, КолонкиУдаляемые);
	
	МасУдаляемых=ЭтаФорма.ТабБанковскиеСчета.НайтиСтроки(Новый Структура("Замещен", Истина));
	
	Для Каждого СтрУдаляемых Из МасУдаляемых Цикл
		
		Этаформа.Элементы.Удалить(ЭтаФорма.Элементы.Найти("Банк_" + СтрУдаляемых.ИмяКолонки));
		
		ЭтаФорма.ТабБанковскиеСчета.Удалить(СтрУдаляемых);
		
	КонецЦикла;
	
	НомПП = 1;
	Четный = Истина;	
	Для Каждого Стр Из ЭтаФорма.ТабОрганизации Цикл
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("Группа_" + НомПП, Тип("ГруппаФормы"),
			Элементы.ТабФинансовыхПотоков, Элементы.ТабФинансовыхПотоковПоследняяКолонка);
		НовыйЭлемент.Вид = ВидГруппыФормы.ГруппаКолонок;
		НовыйЭлемент.Заголовок = Стр.Заголовок; 
		НовыйЭлемент.Группировка = ГруппировкаКолонок.Горизонтальная;
		НовыйЭлемент.Видимость = Истина;
		НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.ОтображатьВШапке = Истина;
		
		ОбъектНастройка = Стр.Настройка.ПолучитьОбъект();
		НовыйЭлемент.ЦветТекстаЗаголовка = ОбъектНастройка.ЦветТекста.Получить();
		НовыйЭлемент.ЦветФонаЗаголовка = ОбъектНастройка.ЦветФона.Получить();
		НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(, , Истина);
			
		
		МассивСтрокБанки = ТабБанковскиеСчета.НайтиСтроки(Новый Структура("Организация", Стр.Организация));
		
		Для Каждого СтрМассивСтрокБанки Из МассивСтрокБанки Цикл
		
			ДобавленныйБанк = Элементы.Добавить("Банк_" + СтрМассивСтрокБанки.ИмяКолонки, Тип("ПолеФормы"), ЭтаФорма.Элементы.Найти("Группа_" + НомПП));
			ДобавленныйБанк.Вид = ВидПоляФормы.ПолеВвода;
			ДобавленныйБанк.Заголовок = СтрМассивСтрокБанки.Заголовок; 
			ДобавленныйБанк.ПутьКДанным = "ТабФинансовыхПотоков" + "." + "КолонкаБанк_" + СтрМассивСтрокБанки.ИмяКолонки;
			ДобавленныйБанк.КнопкаВыбора = Истина;
			ДобавленныйБанк.Видимость = Истина;
			ДобавленныйБанк.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			ДобавленныйБанк.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
			ДобавленныйБанк.Ширина = 15;
			ДобавленныйБанк.УстановитьДействие("ПриИзменении", "ТабФинансовыхПотоковБанкПриИзменении");

			ОбъектНастройка = СтрМассивСтрокБанки.Настройка.ПолучитьОбъект();
			ДобавленныйБанк.ЦветТекстаЗаголовка = ОбъектНастройка.ЦветТекста.Получить();
			ДобавленныйБанк.ЦветФонаЗаголовка = ОбъектНастройка.ЦветФона.Получить();
			
			ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
			ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Банк_" + СтрМассивСтрокБанки.ИмяКолонки);
			ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабФинансовыхПотоков." + "КолонкаБанк_" + СтрМассивСтрокБанки.ИмяКолонки); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			ЭлементОтбора.ПравоеЗначение = 0;
			ЭлементОтбора.Использование = Истина;
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 0, 0));
			ЭлементОформления.Использование = Истина;
			
		КонецЦикла;	
			
		НомПП = НомПП + 1;	
			
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиТабличнойЧасти()
	
	Для Каждого СтрПлатежи Из Объект.Платежи Цикл
		
		СтрокиТабФинансовыхПотоков = ТабФинансовыхПотоков.НайтиСтроки(Новый Структура("Показатель", СтрПлатежи.Показатель));
			
		Для Каждого СтрТабФинансовыхПотоков Из СтрокиТабФинансовыхПотоков Цикл	
			
			СтрокиТабБанковскиеСчета = ТабБанковскиеСчета.НайтиСтроки(Новый Структура("БанковскийСчет", СтрПлатежи.БанковскийСчет));
			Если СтрокиТабБанковскиеСчета.Количество() > 0 Тогда
				
				СтрТабФинансовыхПотоков["КолонкаБанк_" + СтрокиТабБанковскиеСчета[0].ИмяКолонки] = СтрПлатежи.Сумма;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если СтрПлатежи.РучноеИзменение Тогда
			
			СтрТаблицаРучныхИзменений = ТаблицаРучныхИзменений.Добавить();
			СтрТаблицаРучныхИзменений.ХозяйственнаяОперация = СтрПлатежи.Показатель.ХозяйственнаяОперация;	
			СтрТаблицаРучныхИзменений.Партнер = СтрПлатежи.Показатель.Партнер;
			СтрТаблицаРучныхИзменений.Показатель = СтрПлатежи.Показатель;
			СтрТаблицаРучныхИзменений.БанковскийСчет = СтрПлатежи.БанковскийСчет;
			СтрТаблицаРучныхИзменений.Сумма = СтрПлатежи.Сумма;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого СтрТабБанковскиеСчета Из ТабБанковскиеСчета Цикл
		
		РассчитатьИтогиНаСервере("КолонкаБанк_" + СтрТабБанковскиеСчета.ИмяКолонки, "Банк_" + СтрТабБанковскиеСчета.ИмяКолонки);		
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДаннымиТабличнойЧастиАвтоматические()
	
	Для Каждого СтрПлатежи Из ТаблицаОплат Цикл
		
		СтрокиТабФинансовыхПотоков = ТабФинансовыхПотоков.НайтиСтроки(Новый Структура("Показатель", СтрПлатежи.Показатель));
			
		Для Каждого СтрТабФинансовыхПотоков Из СтрокиТабФинансовыхПотоков Цикл	
			
			СтрокиТабБанковскиеСчета = ТабБанковскиеСчета.НайтиСтроки(Новый Структура("БанковскийСчет", СтрПлатежи.БанковскийСчет));
			Если СтрокиТабБанковскиеСчета.Количество() > 0 Тогда
				
				СтрокиТаблицаРучныхИзменений = ТаблицаРучныхИзменений.НайтиСтроки(Новый Структура("Показатель, БанковскийСчет",
					СтрПлатежи.Показатель, СтрПлатежи.БанковскийСчет));
					
				Если СтрокиТаблицаРучныхИзменений.Количество() > 0 Тогда
						
					СтрТабФинансовыхПотоков["КолонкаБанк_" + СтрокиТабБанковскиеСчета[0].ИмяКолонки] = СтрокиТаблицаРучныхИзменений[0].Сумма;
					
				Иначе		
					
					СтрТабФинансовыхПотоков["КолонкаБанк_" + СтрокиТабБанковскиеСчета[0].ИмяКолонки] = (-1) * СтрПлатежи.Сумма;
				
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Для Каждого СтрТабБанковскиеСчета Из ТабБанковскиеСчета Цикл
		
		РассчитатьИтогиНаСервере("КолонкаБанк_" + СтрТабБанковскиеСчета.ИмяКолонки, "Банк_" + СтрТабБанковскиеСчета.ИмяКолонки);		
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ОчиститьФинансовыеПоказателиАвтоматические()
	
	Для Каждого СтрПлатежи Из ТаблицаОплат Цикл
		
		СтрокиТабФинансовыхПотоков = ТабФинансовыхПотоков.НайтиСтроки(Новый Структура("Показатель", СтрПлатежи.Показатель));
			
		Для Каждого СтрТабФинансовыхПотоков Из СтрокиТабФинансовыхПотоков Цикл	
			
			Для Каждого СтрТабБанковскиеСчета Из ТабБанковскиеСчета Цикл
				СтрТабФинансовыхПотоков["КолонкаБанк_" + СтрТабБанковскиеСчета.ИмяКолонки] = 0;	
			КонецЦикла;	
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Для Каждого СтрТабБанковскиеСчета Из ТабБанковскиеСчета Цикл
		
		РассчитатьИтогиНаСервере("КолонкаБанк_" + СтрТабБанковскиеСчета.ИмяКолонки, "Банк_" + СтрТабБанковскиеСчета.ИмяКолонки);		
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТабФинансовыхПотоковБанкПриИзменении(Элемент)
	
	РассчитатьИтогиНаСервере("Колонка" + Элемент.Имя, Элемент.Имя);
	
	ТекВидПоказателя = Элементы.ТабФинансовыхПотоков.ТекущиеДанные.ВидПоказателя;
	
	Если ТекВидПоказателя = ПредопределенноеЗначение("Перечисление.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВПлюс")
		ИЛИ ТекВидПоказателя = ПредопределенноеЗначение("Перечисление.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВМинус") Тогда	
		
		ТекПоказатель = Элементы.ТабФинансовыхПотоков.ТекущиеДанные.Показатель; 
		ТекПартнер = Элементы.ТабФинансовыхПотоков.ТекущиеДанные.Партнер;
		
		СтрокиТабБанковскиеСчета = ТабБанковскиеСчета.НайтиСтроки(Новый Структура("ИмяКолонки", СтрЗаменить(Элемент.Имя, "Банк_", "")));
		Если СтрокиТабБанковскиеСчета.Количество() > 0 Тогда
			
			СтрокиТаблицаРучныхИзменений = ТаблицаРучныхИзменений.НайтиСтроки(Новый Структура("Показатель, Партнер, БанковскийСчет", 
				ТекПоказатель, ТекПартнер, СтрокиТабБанковскиеСчета[0].БанковскийСчет));
				
			СтрокиТаблицаОплат = ТаблицаОплат.НайтиСтроки(Новый Структура("Показатель, БанковскийСчет", 
				ТекПоказатель, СтрокиТабБанковскиеСчета[0].БанковскийСчет));
				
			Если СтрокиТаблицаОплат.Количество() > 0 Тогда
						
				Если (-1) * СтрокиТаблицаОплат[0].Сумма = Элементы.ТабФинансовыхПотоков.ТекущиеДанные["Колонка" + Элемент.Имя] Тогда
					
					Если СтрокиТаблицаРучныхИзменений.Количество() > 0 Тогда
						
						ТаблицаРучныхИзменений.Удалить(СтрокиТаблицаРучныхИзменений[0]);
						
					КонецЕсли;	
					
				Иначе
					
					Если СтрокиТаблицаРучныхИзменений.Количество() > 0 Тогда
						
						СтрокиТаблицаРучныхИзменений[0].Сумма = Элементы.ТабФинансовыхПотоков.ТекущиеДанные["Колонка" + Элемент.Имя];
						
					Иначе
						
						СтрТаблицаРучныхИзменений = ТаблицаРучныхИзменений.Добавить();
						СтрТаблицаРучныхИзменений.ХозяйственнаяОперация = 
							CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ТекПоказатель, "ХозяйственнаяОперация");	
						СтрТаблицаРучныхИзменений.Партнер = ТекПартнер;
						СтрТаблицаРучныхИзменений.Показатель = ТекПоказатель;
						СтрТаблицаРучныхИзменений.БанковскийСчет = СтрокиТабБанковскиеСчета[0].БанковскийСчет;
						СтрТаблицаРучныхИзменений.Сумма = Элементы.ТабФинансовыхПотоков.ТекущиеДанные["Колонка" + Элемент.Имя];
							
					КонецЕсли;
					
				КонецЕсли;	
					
			Иначе		
				
				Если СтрокиТаблицаРучныхИзменений.Количество() > 0 Тогда
					
					СтрокиТаблицаРучныхИзменений[0].Сумма = Элементы.ТабФинансовыхПотоков.ТекущиеДанные["Колонка" + Элемент.Имя];
					
				Иначе
					
					СтрТаблицаРучныхИзменений = ТаблицаРучныхИзменений.Добавить();
					СтрТаблицаРучныхИзменений.ХозяйственнаяОперация = 
						CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ТекПоказатель, "ХозяйственнаяОперация");	
					СтрТаблицаРучныхИзменений.Партнер = ТекПартнер;
					СтрТаблицаРучныхИзменений.Показатель = ТекПоказатель;
					СтрТаблицаРучныхИзменений.БанковскийСчет = СтрокиТабБанковскиеСчета[0].БанковскийСчет;
					СтрТаблицаРучныхИзменений.Сумма = Элементы.ТабФинансовыхПотоков.ТекущиеДанные["Колонка" + Элемент.Имя];
						
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры 

&НаСервере
Процедура РассчитатьИтогиНаСервере(Колонка, ИмяКолонкиТаблицы)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка КАК Показатель,
	|	Родитель КАК Родитель,
	|	ВидПоказателя КАК ВидПоказателя
	|ИЗ
	|	Справочник.смартФинансовыеПоказатели
	|ГДЕ
	|	НЕ ПометкаУдаления");
	
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	
	МассивПодИтогов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаПоказателей.ВыгрузитьКолонку("Родитель"));
	
	ОбщийИтог = 0;
	
	Для Каждого СтрМассивПодИтогов Из МассивПодИтогов Цикл
		
		СтрокиТаблицаПоказателей = ТаблицаПоказателей.НайтиСтроки(Новый Структура("Родитель", СтрМассивПодИтогов));
		
		СуммаПодИтог = 0;
		
		Для Каждого СтрТаблицаПоказателей Из СтрокиТаблицаПоказателей Цикл
			
			Если СтрТаблицаПоказателей.ВидПоказателя = Перечисления.смартВидыРасчетовФинансовыхПоказателей.Подитог Тогда
				Продолжить;
			КонецЕсли;	
			
			СтрокиТабФинансовыхПотоков = ТабФинансовыхПотоков.НайтиСтроки(Новый Структура("Показатель", СтрТаблицаПоказателей.Показатель));
			
			Для Каждого СтрТабФинансовыхПотоков Из СтрокиТабФинансовыхПотоков Цикл
					
				СуммаПодИтог = СуммаПодИтог + ?(СтрТабФинансовыхПотоков.ВидПоказателя = Перечисления.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВМинус
					ИЛИ СтрТабФинансовыхПотоков.ВидПоказателя = Перечисления.смартВидыРасчетовФинансовыхПоказателей.РучнойВМинус, -1 , 1) 
						* СтрТабФинансовыхПотоков[Колонка];
				
			КонецЦикла;
		
		КонецЦикла;
		
		СтрокиТабФинансовыхПотоков = ТабФинансовыхПотоков.НайтиСтроки(Новый Структура("Показатель", СтрМассивПодИтогов));
		
		Если СтрокиТабФинансовыхПотоков.Количество() > 0 Тогда
			СтрокиТабФинансовыхПотоков[0][Колонка] = СуммаПодИтог;		
		КонецЕсли;	
		
		ОбщийИтог = ОбщийИтог + СуммаПодИтог;
		
	КонецЦикла;	
	
	Элементы[ИмяКолонкиТаблицы].ТекстПодвала = ОбщийИтог;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФинансовыеПоказатели()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартФинансовыеПоказатели.Ссылка КАК Показатель,
	|	смартФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
	|	смартФинансовыеПоказатели.Партнер КАК Партнер
	|ИЗ
	|	Справочник.смартФинансовыеПоказатели КАК смартФинансовыеПоказатели
	|ГДЕ
	|	НЕ смартФинансовыеПоказатели.ПометкаУдаления
	|	И НЕ смартФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВПлюс)
	|	И НЕ смартФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВМинус)
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартФинансовыеПоказатели.Сортировка,
	|	смартФинансовыеПоказатели.ХозяйственнаяОперация,
	|	смартФинансовыеПоказатели.Партнер.Наименование"); 
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомПП = 5;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТабФинансовыхПотоков = ТабФинансовыхПотоков.Добавить();
		СтрокаТабФинансовыхПотоков.Показатель = Выборка.Показатель;
		СтрокаТабФинансовыхПотоков.ВидПоказателя = Выборка.ВидПоказателя;
		СтрокаТабФинансовыхПотоков.Партнер = Выборка.Партнер;
		СтрокаТабФинансовыхПотоков.НомПП = НомПП;
		
		НомПП = НомПП + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФинансовыеПоказателиАвтоматические()
	
	ТаблицаОплат.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЗаявкаНаРасходованиеДенежныхСредств.БанковскийСчет КАК БанковскийСчет,
	|	ЗаявкаНаРасходованиеДенежныхСредств.Контрагент.Партнер КАК Партнер,
	|	ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента КАК СуммаДокумента,
	|	ЗаявкаНаРасходованиеДенежныхСредств.ПодотчетноеЛицо КАК ПодотчетноеЛицо
	|ПОМЕСТИТЬ ЗаявкиНаРасходованиеДС
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.ЖелательнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Валюта = &RUR
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаРасходованиеДС.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЗаявкиНаРасходованиеДС.БанковскийСчет КАК БанковскийСчет,
	|	ЕСТЬNULL(ЗаявкиНаРасходованиеДС.Партнер, ЗаявкиНаРасходованиеДС.ПодотчетноеЛицо) КАК Партнер,
	|	СУММА(ЗаявкиНаРасходованиеДС.СуммаДокумента) КАК Сумма,
	|	смартФинансовыеПоказатели.Ссылка КАК Показатель,
	|	смартФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя
	|ИЗ
	|	ЗаявкиНаРасходованиеДС КАК ЗаявкиНаРасходованиеДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартФинансовыеПоказатели КАК смартФинансовыеПоказатели
	|		ПО ЗаявкиНаРасходованиеДС.ХозяйственнаяОперация = смартФинансовыеПоказатели.ХозяйственнаяОперация
	|			И (ЗаявкиНаРасходованиеДС.Партнер = смартФинансовыеПоказатели.Партнер
	|				ИЛИ ЗаявкиНаРасходованиеДС.ПодотчетноеЛицо = смартФинансовыеПоказатели.Партнер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкиНаРасходованиеДС.ХозяйственнаяОперация,
	|	ЗаявкиНаРасходованиеДС.БанковскийСчет,
	|	ЕСТЬNULL(ЗаявкиНаРасходованиеДС.Партнер, ЗаявкиНаРасходованиеДС.ПодотчетноеЛицо),
	|	смартФинансовыеПоказатели.Ссылка,
	|	смартФинансовыеПоказатели.ВидПоказателя
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартФинансовыеПоказатели.ХозяйственнаяОперация,
	|	смартФинансовыеПоказатели.Партнер.Наименование"); 
	
	Запрос.УстановитьПараметр("RUR", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Дата));
	
	НомПП = 16;
	
	ТаблицаОплат.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого СтрТаблицаОплат Из ТаблицаОплат Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрТаблицаОплат.Показатель) Тогда
			
			СпрПоказатели = Справочники.смартФинансовыеПоказатели.СоздатьЭлемент();
			СпрПоказатели.Наименование = СтрТаблицаОплат.ХозяйственнаяОперация;
			СпрПоказатели.ХозяйственнаяОперация = СтрТаблицаОплат.ХозяйственнаяОперация;
			СпрПоказатели.Партнер = СтрТаблицаОплат.Партнер;
			СпрПоказатели.ВидПоказателя = Перечисления.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВПлюс;
			СпрПоказатели.Сортировка = 100000;
			СпрПоказатели.Записать();
			
			ТекПоказатель = СпрПоказатели.Ссылка;
			СтрТаблицаОплат.Показатель = ТекПоказатель;
			
		Иначе
			
			ТекПоказатель = СтрТаблицаОплат.Показатель;
			
		КонецЕсли;
		
		СтрокиТабФинансовыхПотоков = ТабФинансовыхПотоков.НайтиСтроки(Новый Структура("Показатель, Партнер", ТекПоказатель, СтрТаблицаОплат.Партнер));
		
		Если СтрокиТабФинансовыхПотоков.Количество() = 0 Тогда
		
			СтрокаТабФинансовыхПотоков = ТабФинансовыхПотоков.Добавить();
			СтрокаТабФинансовыхПотоков.Показатель = ТекПоказатель;
			СтрокаТабФинансовыхПотоков.ВидПоказателя =Перечисления.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВПлюс;
			СтрокаТабФинансовыхПотоков.Партнер = СтрТаблицаОплат.Партнер;
			СтрокаТабФинансовыхПотоков.НомПП = НомПП; 
		
		КонецЕсли;
		
		НомПП = НомПП + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабФинансовыхПотоковПередНачаломИзменения(Элемент, Отказ)
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Показатель) = Тип("СправочникСсылка.смартФинансовыеПоказатели")
		И CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Элемент.ТекущиеДанные.Показатель, "ВидПоказателя")
			= ПредопределенноеЗначение("Перечисление.смартВидыРасчетовФинансовыхПоказателей.Подитог") Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементОформления  = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабФинансовыхПотоков");
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабФинансовыхПотоков." + "ВидПоказателя"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.смартВидыРасчетовФинансовыхПоказателей.Подитог;
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(244, 236, 197));
	ЭлементОформления.Использование = Истина;
		
КонецПроцедуры	

&НаКлиенте
Процедура ВнестиПлатежи(Команда)
	
	ЗаполнитьФинансовыеПоказателиАвтоматические();
	
	ЗаполнитьДаннымиТабличнойЧастиАвтоматические();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабФинансовыхПотоковПриАктивизацииЯчейки(Элемент)
	
	Если СтрНайти(Элемент.ТекущийЭлемент.Имя, "Банк_") = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТекВидПоказателя = Элементы.ТабФинансовыхПотоков.ТекущиеДанные.ВидПоказателя;
	
	Если ТекВидПоказателя = ПредопределенноеЗначение("Перечисление.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВПлюс")
		ИЛИ ТекВидПоказателя = ПредопределенноеЗначение("Перечисление.смартВидыРасчетовФинансовыхПоказателей.АвтоматическийВМинус") Тогда
		
		СуммаРучная = 0;
		СуммаАвтоматическая = 0;
		
		ТекПоказатель = Элементы.ТабФинансовыхПотоков.ТекущиеДанные.Показатель; 
		ТекПартнер = Элементы.ТабФинансовыхПотоков.ТекущиеДанные.Партнер;
		
		СтрокиТабБанковскиеСчета = ТабБанковскиеСчета.НайтиСтроки(Новый Структура("ИмяКолонки", СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Банк_", "")));
		Если СтрокиТабБанковскиеСчета.Количество() > 0 Тогда
			
			СтрокиТаблицаРучныхИзменений = ТаблицаРучныхИзменений.НайтиСтроки(Новый Структура("Показатель, Партнер, БанковскийСчет", 
				ТекПоказатель, ТекПартнер, СтрокиТабБанковскиеСчета[0].БанковскийСчет));
				
			Если СтрокиТаблицаРучныхИзменений.Количество() > 0 Тогда
				
				СуммаРучная = СтрокиТаблицаРучныхИзменений[0].Сумма;
					
			КонецЕсли;
			Элементы.ДекорацияРчнаяКорректировка.Заголовок = " Ручная корректировка: " + СуммаРучная;
			
			СтрокиТаблицаОплат= ТаблицаОплат.НайтиСтроки(Новый Структура("Показатель, Партнер, БанковскийСчет", 
				ТекПоказатель, ТекПартнер, СтрокиТабБанковскиеСчета[0].БанковскийСчет));
				
			Если СтрокиТаблицаОплат.Количество() > 0 Тогда
				
				СуммаАвтоматическая = СтрокиТаблицаОплат[0].Сумма;
					
			КонецЕсли;
			Элементы.ДекорацияПоДаннымСистемы.Заголовок = "По данным системы:" + ?(СуммаАвтоматическая = 0, " ", " -") + СуммаАвтоматическая;
			
		КонецЕсли;
		
		Если СуммаРучная = 0 Тогда
			
			Элементы.ГруппаДекорацииСуммы.Видимость = Ложь;
			
		Иначе
			
			Элементы.ГруппаДекорацииСуммы.Видимость = Истина;
			
		КонецЕсли;	
		
	Иначе
		
		Элементы.ГруппаДекорацииСуммы.Видимость = Ложь;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРучныеКорректировки(Команда)
	
	ТаблицаРучныхИзменений.Очистить();
	
	ОчиститьФинансовыеПоказателиАвтоматические();
	
	ЗаполнитьФинансовыеПоказателиАвтоматические();
	
	ЗаполнитьДаннымиТабличнойЧастиАвтоматические();
	
КонецПроцедуры
